blog/posts/2025-xx-xx-pytorch-and-python-free-threading/wrk-leopard-01-no-gil.txt
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 30s test @ http://dgx:4444/generate/The%20quick%20brown%20fox?max_length=20&device=cuda&seed=42
  14 threads and 14 connections
  Thread Stats   Min      Avg       Stdev     Max     +/- Stdev
    Latency   130.40ms  197.38ms   54.41ms 528.61ms   89.19%
    Req/Sec     1.00      5.63      2.32    10.00     67.76%
  Latency Distribution
      0%  130.40ms
      1%  139.79ms
      2%  143.50ms
      3%  145.78ms
      4%  147.53ms
      5%  149.78ms
      6%  151.18ms
      7%  152.43ms
      8%  153.42ms
      9%  155.29ms
     10%  156.15ms
     11%  157.29ms
     12%  158.27ms
     13%  158.90ms
     14%  159.70ms
     15%  160.73ms
     16%  161.64ms
     17%  162.32ms
     18%  163.09ms
     19%  163.60ms
     20%  164.41ms
     21%  165.17ms
     22%  165.61ms
     23%  166.08ms
     24%  166.75ms
     25%  167.36ms
     26%  167.93ms
     27%  168.51ms
     28%  169.05ms
     29%  169.49ms
     30%  170.23ms
     31%  170.92ms
     32%  171.54ms
     33%  172.10ms
     34%  172.66ms
     35%  173.29ms
     36%  173.98ms
     37%  174.39ms
     38%  174.96ms
     39%  175.47ms
     40%  176.17ms
     41%  176.80ms
     42%  177.24ms
     43%  177.75ms
     44%  178.49ms
     45%  178.92ms
     46%  179.57ms
     47%  180.15ms
     48%  180.62ms
     49%  181.31ms
     50%  182.00ms
     51%  182.60ms
     52%  183.22ms
     53%  184.14ms
     54%  185.01ms
     55%  185.53ms
     56%  186.21ms
     57%  187.30ms
     58%  188.03ms
     59%  188.66ms
     60%  189.14ms
     61%  190.47ms
     62%  191.13ms
     63%  191.69ms
     64%  192.34ms
     65%  193.06ms
     66%  193.87ms
     67%  194.51ms
     68%  195.63ms
     69%  196.68ms
     70%  197.67ms
     71%  198.34ms
     72%  199.90ms
     73%  201.43ms
     74%  202.66ms
     75%  203.56ms
     76%  205.00ms
     77%  206.48ms
     78%  207.76ms
     79%  209.30ms
     80%  210.53ms
     81%  212.11ms
     82%  213.30ms
     83%  215.90ms
     84%  218.09ms
     85%  220.16ms
     86%  224.57ms
     87%  227.99ms
     88%  230.93ms
     89%  234.77ms
     90%  241.08ms
     91%  252.68ms
     92%  302.34ms
     93%  321.04ms
     94%  335.47ms
     95%  339.80ms
     96%  358.81ms
     97%  369.67ms
     98%  379.52ms
     99%  397.66ms
    100%  411.36ms
  2128 requests in 30.06s, 1.17MB read
Requests/sec:     70.80
Transfer/sec:     39.75KB